#Проверить истинность высказывания: «Среди трех данных целых чисел есть хотя бы одна пара взаимно противоположных».
while True:
    try:
        a = int(input("Введите первое целое число: "))
        b = int(input("Введите второе целое число: "))
        c = int(input("Введите третье целое число: "))
        break
    except ValueError:
        print("Ошибка: введите целые числа")

if a == -b or a == -c or b == -c:
    print("Среди чисел", a, b, c, "есть пара взаимно противоположных")
else:
    print("Среди чисел", a, b, c, "нет пары взаимно противоположных")
